package item;

public interface ReservedWord {
    //변수 타입
    String[] reserved = {
            //변수
            "ㅇㅈㅇ", "ㅇㅉㅇ", "ㅇㅂㅇ", "ㅇㅁㅇ", "ㅇㄱㅇ", "ㅇㅅㅇ", "ㅇㅆㅇ",
            //콘솔 제어문
            "ㅅㅁㅅ", "ㅆㅁㅆ", "ㅅㅇㅅ",
            //계산
            "ㅇ+ㅇ", "ㅇ-ㅇ", "ㅇ/ㅇ", "ㅇ*ㅇ", "ㅇ%ㅇ",
            //비교문
            "ㅇ>ㅇ", "ㅇ<ㅇ", "ㅇ=ㅇ", "ㅇ>=ㅇ", "ㅇ<=ㅇ",
            //조건문, 반복문
            "?ㅅ?", "^^",
            //블린형
            "ㅇㅇ", "ㄴㄴ", "ㄸ", "ㄲ",
            //예외처리
            "ㅜㅅㅜ", "ㅜㅆㅜ"
    };
}
