package item;

public interface ReservedWord {
    //변수 타입
    String[] reserved = {
            //변수
            "ㅇㅈㅇ", "ㅇㅉㅇ", "ㅇㅂㅇ", "ㅇㅁㅇ", "ㅇㄱㅇ", "ㅇㅅㅇ", "ㅇㅆㅇ",
            "oio", "oIo", "obo", "oso", "oso", "ofo", "oFo",
            //콘솔 제어문
            "ㅅㅁㅅ", "ㅆㅁㅆ", "ㅅㅇㅅ",
            "uvu", "uVu", "uou",
            //계산
            "ㅇ+ㅇ", "ㅇ-ㅇ", "ㅇ/ㅇ", "ㅇ*ㅇ", "ㅇ%ㅇ",
            "o+o", "o-o", "o/o", "o*o", "o%o",
            //비교문
            "ㅇ>ㅇ", "ㅇ<ㅇ", "ㅇ=ㅇ", "ㅇ>=ㅇ", "ㅇ<=ㅇ",
            "o>o", "o<o", "o=o", "o>=o", "o<=o",
            //조건문, 반복문
            "?ㅅ?", "^^",
            //블린형
            "ㅇㅇ", "ㄴㄴ", "ㄸ", "ㄲ",
            "yy", "nn", "O", "A",
            //예외처리
            "ㅜㅅㅜ", "ㅜㅆㅜ",
            "tut", "tUt"
    };
}
